package com.kuang.operator;

public class Demo06 {
    public static void main(String[] args) {
        /*位运算（与二进制有关），计算机处理起来较快
        A=0011 1100
        B=0000 1101

        A&B=0000 1100
        A|B=0011 1101
        A^B=0011 0001(异或：相同则为0，不同则为1）
        ~B=1111 0010(对B取反）
        2*8=16    (2*2*2*2)

        <<：箭头指向左边，为左移，相当于乘以2
        0000 0000    0
        0000 0001    1
        0000 0010    2
        0000 0011    3
        0000 0100    4
        0000 1000    8
        0001 0000    16
        >>:箭头指向右边，为右移，相当于除以2
         */
        System.out.println(2<<3);
    }
}
