package work1;

import java.util.Scanner;

public class Work1_1 {
   /* 编写程序，计算个人所得税。
    计算方法：
    起征点：5000元
    收入-起征点，差值部分：
            1、不超过1500元的部分，税率3%
            2、超过1500元至4500元的部分，税率10%
            3、超过4500元至9000元的部分，税率20%
            4、超过9000元至35000元的部分，税率25%
            5、超过35000元至55000元的部分，税率30%
            6、超过55000元至80000元的部分，税率35%
            7、超过80000元的部分，税率45%
    要求：取小数点后2位，并输出

    如某人的收入为15000元，需要缴纳的个人所得税为：
            15000 - 5000 = 10000
            1500 * 3% + (4500 - 1500) * 10% + (9000 - 4500) * 20% + (10000 - 9000) * 25%*/
    public static void main(String[] args) {
        System.out.println("请输入你的工资：");//提示用户输入工资
        Scanner scanner=new Scanner(System.in);
        double salary=0;
        double tax=0;
        salary=scanner.nextDouble();//读取输入的工资
        if(salary<=5000){//各个范围的收税情况
            tax=0;
        }if(salary>5000&&(salary-5000)<=1500){
            tax=salary*0.03;
        }
        if((salary-5000)>1500&&(salary-5000)<=4500){
            tax=1500*0.03+(salary-1500)*0.1;
        }
        if((salary-5000)>4500&&(salary-5000)<=9000){
            tax=1500*0.03+(4500-1500)*0.1+(salary-4500)*0.2;
        }
        if((salary-5000)>9000&&(salary-5000)<=35000){
            tax=1500*0.03+(4500-1500)*0.1+(9000-4500)*0.2+(salary-9000)*0.25;
        }
        if((salary-5000)>35000&&(salary-5000)<=55000){
            tax=1500*0.03+(4500-1500)*0.1+(9000-4500)*0.2+(35000-9000)*0.25+(salary-35000)*0.3;
        } if((salary-5000)>55000&&(salary-5000)<=80000){
            tax=1500*0.03+(4500-1500)*0.1+(9000-4500)*0.2+(35000-9000)*0.25+(55000-35000)*0.3+(salary-55000)*0.35;
        } if((salary-5000)>80000){
            tax=1500*0.03+(4500-1500)*0.1+(9000-4500)*0.2+(35000-9000)*0.25+(55000-35000)*0.3+(80000-55000)*0.35+(salary-80000)*0.45;
        }
        System.out.printf("%.2f",tax);//输出税收
    }
}
